app/controllers/posts_controller.rb

SELECT `posts`.* FROM `posts` ORDER BY `posts`.`created_at` DESC
---
  def index
    @posts = Post.all.order(created_at: :desc)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @post = Post.find_by(id: params[:id])
    @user = User.find_by(id: @post.user_id)

INSERT INTO "posts" ("content", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["content", "test"], ["created_at", "2018-06-20 02:14:48.232449"], ["updated_at", "2018-06-20 02:14:48.232449"]]
---
  def create
    @post = Post.new(content: params[:content], user_id: @current_user.id, message: params[:message])
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "posts" SET "content" = $1, "updated_at" = $2 WHERE "posts"."id" = $3  [["content", "私の名前はd"], ["updated_at", "2018-06-20 03:00:07.899271"], ["id", 3]]
---
  def update
    @post = Post.find_by(id: params[:id])
    @post.content = params[:content]
    if @post.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 3]]
---
  def destroy
    @post = Post.find_by(id: params[:id])
    @post.destroy