app/controllers/users_controller.rb

  def index
    @user = User.find_by(id: @current_user.id)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def create
    @user = User.new().create_user(params[:name], params[:email], params[:user_group], params[:password])
---
INSERT INTO `users` (`name`, `email`, `created_at`, `updated_at`, `image_name`, `password`) VALUES ('watashiu', 'watashi', '2018-07-03 00:59:10', '2018-07-03 00:59:10', 'default_user.jpg', 'test')

  def edit
    @user = User.find_by(id: params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1

  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]

    if params[:image]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image]
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end

    if @user.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 11 LIMIT 1
UPDATE `users` SET `name` = 'kenij', `email` = 'kodomo893@gmail.com', `image_name` = '11.jpg', `updated_at` = '2018-07-03 02:24:54' WHERE `users`.`id` = 11